In [16]:
import sqlite3

In [ ]:
db=sqlite3.connect("Dataset/IMDB.sqlite")
#to make the connection we take help of connect present inside sqlite3 lib
#inside connect we need to pass the path of file we need to connect

In [ ]:
#this is connection object which is referencing to some memory location
db

In [ ]:
db_1=sqlite3.connect("Dataset/IMDB_1.sqlite")
#we dont get error even if we pass the file whcih iis not exist

In [ ]:
db_1
#one file with name IMDB_1 is been created

In [17]:
db=sqlite3.connect("Dataset/School.sqlite")

In [18]:
db

In [19]:
cur=db.cursor()
cur

In [ ]:
sql_query='create table student (RollNumber int Primary key,Name Text,Age int)'

In [ ]:
cur.execute(sql_query)

In [ ]:
cur.execute('Insert into student values(101,"Yashwin",20)')

In [ ]:
 db.commit()

In [ ]:
cur.execute('create table EmployeeDetail (employee_id int primary key,name text,age int,department text,salary int)')

In [ ]:
db.commit()

In [ ]:
cur.execute('Insert into EmployeeDetail values(100,"Rishav",25,"Marketing",50000)')
cur.execute('Insert into EmployeeDetail values(101,"Abhishek",26,"Operations",60000)')
cur.execute('Insert into EmployeeDetail values(102,"Aman",24,"Human Resources",75000)')

In [ ]:
db.commit()

In [21]:
cur.execute('Insert into Student values(103,"Mohit",24)')

In [22]:
db.commit()

In [23]:
rollNumber=104
Name="Nikhil"
age=34

cur.execute('Insert into student values(?,?,?)',(rollNumber,Name,age))

In [24]:
db.commit()

In [25]:
values=[(105,"Neha",20),(106,"Manisha",21),(107,"Ankush",22)]
cur.executemany('insert into student values(?,?,?)',values)

In [26]:
db.commit()

In [28]:
cur.execute('update student set age=30')

In [29]:
db.commit()

In [30]:
cur.execute('update student set age=22 where name="Yashwin"')

In [31]:
db.commit()

In [32]:
new_age=25
cur.execute('update student set age=? where rollnumber=106',(new_age,))
db.commit()

In [35]:
#deleting employee_id 101 without parameter
cur.execute('delete from EmployeeDetail where employee_id=101')

In [36]:
db.commit()

In [37]:
#Deleting employiee with parameter
employee_id=102
cur.execute('delete from employeedetail where employee_id=?',(employee_id,))

In [38]:
db.commit()

In [42]:
#Deleting employiee with parameter
employee_id=(100)
cur.execute('delete from employeedetail where employee_id=?',(employee_id,))
db.commit()

In [43]:
#Deleting employiee with parameter
employee_id=(103)
cur.execute('delete from employeedetail where employee_id=?',(employee_id,))
db.commit()

In [51]:
cur.execute('drop table employeedetail')
db.commit()

In [52]:
cur.execute('create table EmployeeDetail (employee_id int primary key,name text,age int,department text,salary int)')
db.commit()

In [53]:
cur.execute('Insert into EmployeeDetail values(101,"Aadarsh",25,"Marketing",50000)')
cur.execute('Insert into EmployeeDetail values(102,"Aarti",27,"Operations",60000)')
cur.execute('Insert into EmployeeDetail values(103,"Siddart",25,"Finance",85000)')
cur.execute('Insert into EmployeeDetail values(104,"Aman",24,"Human Resources",75000)')
cur.execute('Insert into EmployeeDetail values(105,"Amit",30,"Marketing",50000)')
cur.execute('Insert into EmployeeDetail values(106,"Shivansh",26,"IT",90000)')
cur.execute('Insert into EmployeeDetail values(107,"Vaibhav",23,"Finance",85000)')
cur.execute('Insert into EmployeeDetail values(108,"Himanshu",26,"IT",90000)')
cur.execute('Insert into EmployeeDetail values(109,"Raman",25,"Operations",60000)')
cur.execute('Insert into EmployeeDetail values(110,"Kunal",26,"Marketing",50000)')
cur.execute('Insert into EmployeeDetail values(111,"Adhira",29,"Human Resources",75000)')
cur.execute('Insert into EmployeeDetail values(112,"Tanya",24,"Marketing",50000)')
db.commit()

### Fetch data

In [54]:
cur.execute('select * from student')

In [55]:
for row in cur:
    print(row)

(101, 'Yashwin', 22)
(103, 'Mohit', 30)
(104, 'Nikhil', 30)
(105, 'Neha', 30)
(106, 'Manisha', 25)
(107, 'Ankush', 30)

In [58]:
#other methods incliude:fetchone(),fetchmany(),fetchall():
cur.execute('select * from student')
print(cur.fetchone())
print(cur.fetchone())#fetchone return the first row of our table

(101, 'Yashwin', 22)
(103, 'Mohit', 30)

In [60]:
cur.execute('select * from student')
print(cur.fetchmany(3))
#fetchmany return the tuple of rows of our table

[(101, 'Yashwin', 22), (103, 'Mohit', 30), (104, 'Nikhil', 30)]

In [62]:
cur.execute('select * from student')
print(cur.fetchall())
#fetchall return the tuple of rows all our table

[(101, 'Yashwin', 22), (103, 'Mohit', 30), (104, 'Nikhil', 30), (105, 'Neha', 30), (106, 'Manisha', 25), (107, 'Ankush', 30)]

In [63]:
cur.execute('select * from student where rollnumber>103')
print(cur.fetchall())

[(104, 'Nikhil', 30), (105, 'Neha', 30), (106, 'Manisha', 25), (107, 'Ankush', 30)]

In [64]:
cur.execute('select * from student where name like "Y%"')
print(cur.fetchall())

[(101, 'Yashwin', 22)]

In [68]:
#print the employee_id of employyee working in finance department:
cur.execute('select employee_id from EmployeeDetail where department="Finance"')
ids=cur.fetchall()
for id in ids:
    print(id)

(103,)
(107,)

In [70]:
#print department and number of employe:
cur.execute('select department,count(*) from EmployeeDetail group by department')
departments=cur.fetchall()
for dep in departments:
    print(dep)

('Finance', 2)
('Human Resources', 2)
('IT', 2)
('Marketing', 4)
('Operations', 2)

## SQLite with pandas

In [71]:
import pandas as pd

db=sqlite3.connect('Dataset/school.sqlite')

In [72]:
#this takes two arguments first the query with which we want to extract our data
#next our connection object
data=pd.read_sql_query("Select * from student",db)
data

   RollNumber     Name  Age
0         101  Yashwin   22
1         103    Mohit   30
2         104   Nikhil   30
3         105     Neha   30
4         106  Manisha   25
5         107   Ankush   30

In [74]:
 data['Age']==30

0    False
1     True
2     True
3     True
4    False
5     True
Name: Age, dtype: bool

In [75]:
data[ data['Age']==30]

   RollNumber    Name  Age
1         103   Mohit   30
2         104  Nikhil   30
3         105    Neha   30
5         107  Ankush   30

In [76]:
data = pd.DataFrame([[201, "Aman", "English", 20000], [202, "Komal", "Maths", 22000], [203, "Mahesh", "Science", 23000]], 
                   columns = ["ID", "Name", "Course", "Salary"])
data

    ID    Name   Course  Salary
0  201    Aman  English   20000
1  202   Komal    Maths   22000
2  203  Mahesh  Science   23000

In [77]:
data.to_sql("Faculty", db)

3

In [79]:
data = pd.read_sql_query("Select * from Student", db)
data["Address"] = "Test"
data

   RollNumber     Name  Age Address
0         101  Yashwin   22    Test
1         103    Mohit   30    Test
2         104   Nikhil   30    Test
3         105     Neha   30    Test
4         106  Manisha   25    Test
5         107   Ankush   30    Test

## IMDB sqlite

In [82]:
db=sqlite3.connect("Dataset/IMDB.sqlite")

In [84]:
data=pd.read_sql_query("Select * from genre",db)

In [96]:
data

    Movie_id      genre
0      36809  Biography
1      30114  Adventure
2      37367     Comedy
3      49473     Comedy
4      14867      Drama
..       ...        ...
346    38262
347    10023     Comedy
348    27783     Sci-Fi
349    42294     Sci-Fi
350    32217     Comedy

[351 rows x 2 columns]

In [106]:
genre = {}
for row in data.genre:
    if(row!=''):
        genre[row] = genre.get(row,0)+1
gen=list(genre.keys())
num=list(genre.values())
for i in range(len(gen)):
    print(gen[i],"",num[i])

Biography  21
Adventure  43
Comedy  31
Drama  77
Action  33
Animation  13
Crime  11
Mystery  7
Romance  13
Thriller  14
History  6
Sport  3
Western  2
Sci-Fi  18
Family  3
Musical  1
Fantasy  7
War  2
Horror  2
Music  3

In [107]:
data=pd.read_sql_query("Select * from IMDB",db)
data

,Movie_id,Title,Rating,TotalVotes,MetaCritic,Budget,Runtime,CVotes10,CVotes09,CVotes08,...,Votes3044,Votes3044M,Votes3044F,Votes45A,Votes45AM,Votes45AF,VotesIMDB,Votes1000,VotesUS,VotesnUS
0,36809,12 Years a Slave (2013),8.1,496092,96,20000000.0,134 min,75556,126223,161460,...,8.0,7.9,8.0,7.8,7.8,8.1,8.0,7.7,8.3,8.0
1,30114,127 Hours (2010),7.6,297075,82,18000000.0,94 min,28939,44110,98845,...,7.5,7.5,7.5,7.3,7.3,7.5,7.6,7.0,7.7,7.6
2,37367,50/50 (2011),7.7,283935,72,8000000.0,100 min,28304,47501,99524,...,7.6,7.6,7.6,7.4,7.4,7.5,7.4,7.0,7.9,7.6
3,49473,About Time (2013),7.8,225412,,12000000.0,123 min,38556,43170,70850,...,7.6,7.6,7.7,7.6,7.5,7.8,7.7,6.9,7.8,7.7
4,14867,Amour (2012),7.9,76121,94,8900000.0,127 min,11093,15944,22942,...,7.7,7.7,7.9,7.9,7.8,8.1,6.6,7.2,7.9,7.8
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
112,38262,Whiplash (2014),8.5,492285,88,3300000.0,107 min,110404,161864,132656,...,8.3,8.3,8.2,8.1,8.1,8.2,8.7,8.0,8.6,8.4
113,10023,Wreck-It Ralph (2012),7.7,295125,72,165000000.0,,41980,50262,96477,...,7.6,7.6,7.7,7.4,7.4,7.5,7.4,7.2,7.9,7.6
114,27783,X-Men: Days of Future Past (2014),8.0,560736,74,200000000.0,132 min,91765,127521,183578,...,7.8,7.8,8.0,7.7,7.7,7.9,7.5,7.4,8.1,7.9
115,42294,X-Men: First Class (2011),7.8,556713,65,160000000.0,132 min,64428,96219,200144,...,7.7,7.6,7.8,7.6,7.5,7.7,7.6,7.3,7.8,7.7
116,32217,Zootopia (2016),8.1,309474,78,150000000.0,108 min,53626,70912,102352,...,7.8,7.8,8.1,7.8,7.8,8.1,7.7,7.6,8.0,8.0

In [110]:
data.Rating[data.Rating.argmax()]

8.8

In [111]:
#print most rated movie name:
data.Title[data.TotalVotes.argmax()]

'Inception\xa0(2010)'